Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: །བྱང་ཆུབ་སྙིང་པོར་སངས་རྒྱས་བྱང་ཆུབ་པར།
en: “Once he has realized awakening on the seat of awakening,

source: །དེ་ཡིས་དྲན་པ་རྣམ་པར་ཆུད་མི་ཟ། །
en: His awareness does not disappear

source: གང་ཆོས་རྟོགས་པ་དེ་ནི་རྟོགས་བྱ་མིན། །
en: The Dharma he realized is not something to be known.

source: །རྟོག་པ་མེད་ཅིང་རྣམ་པར་རྟོག་མེད་པར།
en: “He does not conceptualize or maintain judgements.

source: །རང་བྱུང་ཏིང་ངེ་འཛིན་ལ་མཉམ་གནས་ཏེ། །
en: He remains in the sameness of spontaneous focus,

source: ཆོས་རྣམས་ཀུན་ལ་མི་གནས་བསམ་གཏན་བྱེད། །
en: And his concentration does not rely on any phenomena.

source: འདྲེན་པའི་ཤེས་རབ་ཀྱིས་ནི་རབ་སྟོན་ཅིང་།
en: “The leader gives instruction with wisdom.

source: །སེམས་ཅན་ཀུན་གྱི་སྤྱོད་པ་རབ་མཁྱེན་ཏེ། །
en: He knows the activities of all beings

source: དེ་དག་ལ་ནི་བསམ་བཞིན་ཆོས་ཀྱང་འཆད། །
en: And speaks the Dharma according to their inclinations.

source: ཉན་ཐོས་རྣམས་ཀྱི་རྣམ་གྲོལ་སྒྲ་ཕྱིར་འགྲོ། །
en: “The liberation of the śrāvakas comes through words,

source: རང་རྒྱལ་གྱི་ནི་རྐྱེན་གྱི་འདུ་ཤེས་ཏེ། །
en: That of the pratyekabuddhas through contemplating conditions.

source: སངས་རྒྱས་རྣམས་ཀྱི་བཏང་སྙོམས་བསམ་མི་ཁྱབ། །
en: Beyond clinging, unstained like the sky,

source: ཆགས་ལས་རབ་འདས་དྲི་མེད་ནམ་མཁའ་བཞིན། །
en: The equanimity of the buddhas is inconceivable.

source: སེམས་ཀྱི་རྒྱུད་འདི་རང་བཞིན་རྣམ་གྲོལ་ཏེ། །
en: “Mind primordially unbound,

source: སེམས་ནི་སྔོན་ནས་བཅིངས་པར་གྱུར་པ་མེད། །
en: Mental continua naturally liberated,

source: ཇི་ལྟར་རྣམ་གྲོལ་དེ་ལྟར་ཆོས་སྟོན་ཏེ། །
en: This liberation is the Dharma that he teaches.

source: གཤེགས་དང་བཞུགས་དང་གྲོང་ཁྱེར་འཇུག་པ་དང་། །སྤྱོད་ལམ་དག་ནི་མཐོང་ན་མིག་ཀྱང་འཕྲོག །
en: “He maintains his spiritual practice, keeping his gaze lowered When standing, walking, or entering towns.

source: སངས་རྒྱས་རྣམས་ཀྱི་དཔེ་བྱད་བཟང་པོ་དང་། །མཚན་དང་འོད་རྣམས་ཐམས་ཅད་འདུལ་བར་ཞུགས། །
en: The luminosity of all the buddhas’ characteristics and marks Comes from their engagement with the training.

source: སེམས་ཅན་སྙིང་པོ་ནམ་ཞིག་འོད་གཏོང་ཚེ། །སྲོག་ཆགས་བྱེ་བ་མང་པོར་བདེར་འགྱུར་ཏེ། །
en: “When he sends out his light, which strengthens all beings, Many millions of living beings experience joy.

source: འོད་ཀྱིས་རེག་པ་དག་ནི་འདུལ་བར་འགྱུར། །
en: Touched by the light, they are trained.

source: །རང་བྱུང་བ་ནི་གསུང་གཅིག་བརྗོད་པས་ན། །
en: “He spontaneously expresses a single sound,

source: སེམས་ཅན་བསམ་པ་བཞིན་དུ་གསུང་ཐོས་ཏེ། །
en: And sentient beings hear sound appropriate to their inclinations.

source: བྲག་ཆ་ལྟ་བུ་དེའི་གསུང་ཡང་ཐོས། །
en: His speech is heard like an echo.

source: ཡེ་ཤེས་ཀྱིས་ནི་འདྲེན་པའི་ལས་བྱས་ཏེ། །
en: “For the Sugata there is no mental activity;

source: བདེ་བར་གཤེགས་ལ་སེམས་ལས་ཅུང་ཟད་མེད། ། སེམས་ཅན་བསམ་ལ་ཡེ་ཤེས་རྗེས་སུ་ཞུགས། །
en: The leader’s acts are performed through knowledge, And with knowledge he engages with the inclinations of sentient beings.

source: ཏིང་འཛིན་བསམ་གཏན་དང་ནི་རབ་ལྡན་ཏེ། །
en: “He genuinely applies meditative concentration

source: སྤྲོས་པ་ཐམས་ཅད་ཀྱི་ཡང་རྒྱུ་བ་མེད། །
en: And is unswayed by any mental proliferation.

source: ནམ་མཁའ་ལྟ་བུར་མཉམ་པ་ཉིད་དུ་གནས། །
en: He remains in space-like equilibrium.

source: །འདས་པའི་དུས་ལ་དེ་ཡི་ཡེ་ཤེས་ཞུགས། ། འགྲོ་བ་སྣ་ཚོགས་རྣམ་འབྱེད་ཤེས་པ་ཡི། །ཆོས་རྣམས་ཀུན་ལ་སྒྲིབ་པ་མེད་པར་འཇུག ། དེ་ནི་རྒྱལ་བ་རྣམས་ཀྱི་མ་འདྲེས་ཆོས། །
en: “Through his knowledge, he has unlimited access To all phenomena that took place in the past. He knows all the various different creatures in minute detail. This is one of the leader’s unique qualities.

source: མ་འོངས་དུས་ན་གང་དག་འཇིག་རྟེན་དུ། །འབྱུང་བར་འགྱུར་དང་འབྱུང་བར་མི་འགྱུར་དང་། །སེམས་ཅན་ཞིང་དང་རྒྱལ་བ་བཤད་པ་དང་། །དེ་དག་ཐམས་ཅད་སངས་རྒྱས་མ་ལུས་མཁྱེན། །
en: “Whatever may or may not occur In future times, The Buddha knows completely all that is spoken Among beings, in buddha fields, and by victorious ones.

source: མ་འོངས་དེ་ལ་རྗེས་སུ་རབ་ལྟ་ཞིང་། །དེ་བཞིན་སེམས་ཅན་རྣམས་ཀྱི་ཆོས་ཀྱང་མཁྱེན། ། དེ་ཡི་སེམས་ནི་གཡེང་བར་མི་འགྱུར་ཏེ། །
en: “His mind does not become scattered When he looks into the future. He sees the Dharma that is suitable for sentient beings.

source: །ད་ལྟར་ལམ་གང་འཇུག་པར་འགྱུར་བ་དག ། ཐམས་ཅད་རྒྱལ་བས་ཆགས་མེད་རབ་ཏུ་མཁྱེན། །
en: “The Victorious One has unimpeded knowledge Of all the paths traversed in the present.

source: འདྲེན་པའི་སྤྱོད་ཡུལ་ནམ་མཁའ་ལྟ་བུ་སྟེ། །
en: The domain of the leader is like the heavens.

source: །དེ་བཞིན་གཤེགས་པའི་ཆོས་ནི་མ་འདྲེས་པ། །བཅྭ་བརྒྱད་གསུངས་པ་བསམ་གྱིས་མི་ཁྱབ་སྟེ། །
en: “The eighteen unique qualities of the Tathāgata Expressed here are inconceivable.

source: དེ་བཞིན་གཤེགས་པ་ནམ་མཁའ་འདྲ་བར་ནི། །དད་མཁས་བྱང་ཆུབ་སེམས་དཔའ་དད་པར་བྱེད། །
en: The devoted bodhisatva has faith In the sky-like state of the Tathāgata.

source: ཤཱ་རིའི་བུ་འདི་དག་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་དེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དེ་དག་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་གྱི་ནང་དུ་གཤེགས་ན་ སེང་གེའི་སྒྲ་ཡང་དག་པར་སྒྲོག་ཅིང་ཁྱུ་མཆོག་གི་གནས་སུ་ཞལ་གྱིས་འཆེ་སྟེ། དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ། ལྷ་འམ། བདུད་དམ། སུས་ཀྱང་འཇིག་རྟེན་དུ་ཆོས་དང་འཐུན་པར་མ་བསྐོར་བའི་ཚངས་པའི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་ཏོ། །
en: “Śāriputra, these are the Tathāgata’s eighteen unique buddha qualities, and with them the tathāgata, arhat, fully accomplished Buddha roars a true lion’s roar in the assembly, asserts the state of the supreme bull, and turns the holy wheel that no ascetic, brahmin, god, or māra in this world has legitimately turned.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་དད་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་བཅུས་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མི་བྱེད། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ། རངས་པ་རྙེད་ཅིང་། ངོ་མཚར་དང་། རྨད་དུ་འདུ་ཤེས་སྐྱེད་དོ། །
en: “Śāriputra, given these ten inconceivable qualities, a bodhisatva with firm devotion has great faith, trust, and confidence in the Tathāgata. He has no uncertainty or doubt about them. The Tathāgata brings him pleasure, joy, and satisfaction, and he considers him to be truly wondrous and extraordinary.”

source: དེ་བཞིན་གཤེགས་པའི་བསམ་གྱིས་མི་ཁྱབ་པའི་ལེའུ་སྟེ་བཞི་པའོ།། །།
en: This is the fourth chapter, “The Inconceivable Tathāgata.”

source: བམ་པོ་བརྒྱད་པ།
en: Chapter 5:

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་ལྟར་དད་པ་ལ་རབ་ཏུ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྣོད་དུ་རིག ། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་སྣོད་དུ་རིག ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་སྣོད་དུ་རིག་ནས། དེའི་དྲུང་དུ་གཤེགས་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་ལམ་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །
en: “Now, Śāriputra, the lords, the buddhas, consider a bodhisatva with such firm devotion to be a suitable vessel. They consider him to be a suitable vessel for the cycle of teachings contained within The Collected Teachings on the Bodhisatva. They consider him to be a suitable vessel for the Buddhist teachings, and they reveal to him the path of the bodhisatva when he approaches them.

source: དེ་ལྟ་བས་ན་ཤཱ་རིའི་བུ་རྣམ་གྲངས་འདིས་ཀྱང་། དེ་ལྟར་དད་པ་ལ་རབ་ཏུ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་སྣོད་དུ་རིག ། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་སྣོད་དུ་རིག ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་སྣོད་དུ་རིག་ནས། དེའི་དྲུང་དུ་གཤེགས་ཏེ། བྱང་ཆུབ་ཀྱི་ལམ་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་དེ་ལྟར་རིག་པར་བྱའོ། །
en: Therefore, Śāriputra, one should understand things by means of this cycle of teachings. The lords, the buddhas, consider a bodhisatva with such firm devotion to be a suitable vessel. They consider him to be a suitable vessel for the cycle of teachings contained within The Collected Teachings on the Bodhisatva. They consider him to be a suitable vessel for the Buddhist teachings, and they reveal to him the path of the bodhisatva when he approaches them.

source: ཤཱ་རིའི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་བས་ཀྱང་ཚེས་གྲངས་མེད་པ། ཡངས་པ་ཚད་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པ་དེའི་ཚེ་དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཕུང་པོ་ཆེན་པོ་ཞེས་བྱ་བ། རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་ མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་སྟེ གང་འདི་ལྷར་བཅས་པའི་འཇིག་རྟེན་དང་། བདུད་དུ་བཅས་པ་དང་། ཚངས་པར་བཅས་པ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་རང་གི་མངོན་པར་ཤེས་པས་མངོན་སུམ་དུ་བྱས་ཏེ་ བསྒྲུབས་ནས་ གནས་སོ། ། དེ་ཆོས་སྟོན་ཏེ། ཚངས་པར་སྤྱོད་པ། ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བ། དོན་བཟང་པོ། ཚིག་འབྲུ་བཟང་པོ། མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ། ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཕུང་པོ་ཆེན་པོའི་ཉན་ཐོས་ཁྲག་ཁྲིག་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་ཀྱི་ཉན་ཐོས་ཀྱི་ཚོགས་ཆེན་པོ་བྱུང་སྟེ། ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ། སེམས་ཐམས་ཅད་ཀྱི་དབང་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཤ་སྟག་གོ །
en: “At one time, Śāriputra, a great many eons ago, uncountable, inconceivable, innumerable eons upon innumerable eons ago, a tathāgata, arhat, fully accomplished buddha by the name of Mahāskandha appeared in the world. He was perfect in wisdom and conduct, and he was a sugata, a knower of the world, an unsurpassable guide for those who wished to train, a teacher of gods and men, awakened, a lord. When he himself attained realization and accomplishment through his superior abilities, he surpassed the world with its gods, with its māras, with its brahmā gods, with its various classes of ascetics and brahmins—the world with its gods, human beings, and asuras. He taught the Dharma, which is excellent in the beginning, excellent in the middle, excellent in the end, and accurate in meaning and well expressed, and he reveals the life of purity that is simple, complete, perfect, and pure. Śāriputra, with the tathāgata, the arhat, the fully accomplished Buddha Mahāskandha, there was a great assembly of seven thousand two hundred billion śrāvakas. All of them were arhats who had eliminated defilements, were free from vices, and had reached the very highest level of complete mastery of the mind.

source: ཤཱ་རིའི་བུ་དེའི་དུས་ན་རྒྱལ་པོ་ཚེ་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བ་ཆོས་ཅན་ཆོས་ཀྱི་རྒྱལ་པོ་ཞིག་བྱུང་ངོ་། ། ཡང་ཤཱ་རིའི་བུ་རྒྱལ་པོ་ཚེ་རྣམ་པར་རྒྱལ་བའི་གྲོང་ཁྱེར་རྣམ་པར་རྒྱལ་བའི་རྒྱལ་མཚན་ཞེས་བྱ་བ། རྒྱལ་པོའི་གནས་འབྱོར་པ་མོད་པ། བདེ་བ། ལོ་ལེགས་པ། དགའ་བ་འགྲོ་བ་མང་པོ་དང་། མིས་གང་བ་ཞིག་ཡོད་དེ ཡང་ཤཱ་རིའི་བུ་རྒྱལ་པོ་ཚེ་རྣམ་པར་རྒྱལ་བའི་ཁྱེའུ་གཞོན་ནུ་བརྩོན་འགྲུས་སྤྱོད་པ་ཞེས་བྱ་བ་སྔོན་དགེ་བའི་རྩ་བ་བསྐྲུན་པ། སྔོན་གྱི་སངས་རྒྱས་ལ་བྱ་བ་བྱས་པ། སྔོན་གྱི་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ལ་བསྙེན་བཀུར་བྱས་པ། གཟུགས་བཟང་བ། མཛེས་པ། བལྟ་ན་ སྡུག་པ། མདོག་བཟང་ཞིང་རྒྱས་པའི་མཆོག་དང་ལྡན་པ་ཞིག་བྱུང་སྟེ ཡང་ཤཱ་རིའི་བུ་དེའི་དུས་ན་གཞོན་ནུ་བརྩོན་འགྲུས་སྤྱོད་བཙུན་མོའི་འཁོར་དང་ལྷན་ཅིག་ཏུ་སྐྱེད་མོས་ཚལ་གྱི་སར་བྱུང་བར་གྱུར་ཏོ། ། དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཕུང་པོ་ཆེན་པོས་ཨེ་མའོ་གཞོན་ནུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་སྣོད་དོ། ། ཨེ་མའོ་གཞོན་ནུ་བརྩོན་འགྲུས་སྤྱོད་འདི་ནི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་སྣོད་དོ་ཞེས་དེ་ལྟར་རིག་ནས་ སྐྱེད་མོས་ཚལ་གྱི་ས་ག་ལ་བ་དང་། གཞོན་ནུ་བརྩོན་འགྲུས་སྤྱོད་ག་ལ་བ་དེར་སོང་སྟེ་ ཕྱིན་ནས་ སྟེང་གི་ནམ་མཁའ་ལ་བཞུགས་ཏེ གཞོན་ནུ་བརྩོན་འགྲུས་སྤྱོད་ལ་བྱང་ཆུབ་ཀྱི་ལམ་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །
en: “At that time, Śāriputra, there was a just king by the name of Vijitāyus who ruled according to the Dharma. The capital city of King Vijitāyus was named Vijitadhvaja, and his royal residence was rich, prosperous, pleasant, abundant, delightful, and filled with throngs of people. Now, Śāriputra, King Vijitāyus had a son by the name of Vīryacarita, who had previously developed roots of virtue, served past buddhas, venerated a hundred thousand million billion buddhas in the past, and was beautiful, handsome, pleasant, and possessed the most wonderful and splendid features. Śāriputra, Prince Vīryacarita once went on an outing accompanied by his harem, and the tathāgata, the arhat, the fully accomplished Buddha Mahāskandha, aware that this prince was truly a suitable vessel for the cycle of teachings contained within The Collected Teachings on the Bodhisatva, that Prince Vīryacarita was truly a suitable vessel for the Buddhist teachings, sought out Prince Vīryacarita in the park where he was staying. When he arrived there, he took his seat in midair and revealed the path of awakening to Prince Vīryacarita.

source: དེ་ལ་བྱང་ཆུབ་ཀྱི་ལམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ལ་བརྩོན་པ་དང་། བསྡུ་བའི་དངོས་པོ་རྣམས་ཀྱི་རྗེས་སུ་འཇུག་པ་སྟེ། དེ་ནི་བྱང་ཆུབ་ཀྱི་ལམ་ཞེས་བྱའོ། ། དེ་ལ་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་གང་ཞེ་ན། འདི་ལ་གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་གྱི་ཁམས་ཇི་ཙམ་པ་དེ་ཙམ་དུ་བྱམས་པས་ཁྱབ་པར་བྱེད་དོ། ། སེམས་ཅན་གྱི་ཁམས་ཇི་ཙམ་ཞེ་ན། ནམ་མཁའི་ཁམས་ཇི་ཙམ་པ་སེམས་ཅན་གྱི་ཁམས་ཀྱང་དེ་ཙམ་མོ། ། གཞོན་ནུ་འདི་ལྟ་སྟེ། དཔེར་ན་ནམ་མཁའི་ཁམས་འདིས་ཁྱབ་པར་མ་གྱུར་པ་གང་ཡང་མེད་དོ། ། གཞོན་ནུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་བྱམས་པ་འདིས་སེམས་ཅན་གྱི་རིས་ན་གང་ཁྱབ་པར་མ་གྱུར་པའི་སེམས་ཅན་དེ་གང་ཡང་མེད་དོ། ། འདི་ལྟ་སྟེ་གཞོན་ནུ་སེམས་ཅན་གྱི་ཁམས་དཔག་ཏུ་མེད་པ་དེ་བཞིན་དུ་གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའི་བྱམས་པ་བསྒོམ་པ་ཡང་དཔག་ཏུ་མེད་དོ། ། གཞོན་ནུ་དེ་ལྟར་ན་ནམ་མཁའ་མཐའ་ཡས་པས་སེམས་ཅན་མཐའ་ཡས་སེམས་ཅན་མཐའ་ཡས་པས་བྱམས་པ་མཐའ་ཡས་སོ། ། གཞོན་ནུ་ཡང་སེམས་ཅན་གྱི་ཁམས་ནི་ཆེས་མང་གི་སའི་ཁམས་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་ནི་དེ་ལྟ་མ་ཡིན་མོད་ཀྱི། འོན་ཀྱང་གཞོན་ནུ་སེམས་ཅན་གྱི་ཁམས་ཚད་མེད་པ་ཇི་ཙམ་པ་དེའི་དོན་ཤེས་པར་བྱ་བའི་ཕྱིར་དཔེ་བསྟན་ཏོ།
en: “ ‘What is the path of awakening? To exert oneself in love and in the perfections and to employ the methods for bringing people together—this is what is called the path of awakening. What does having love for all sentient beings entail? Young prince, the bodhisatva’s love extends throughout the whole of the realm of sentient beings. How extensive is the realm of sentient beings? The realm of sentient beings is as extensive as the realm of space. Young prince, consider this. There is nothing that is not encompassed by the realm of space, and likewise, young prince, there is not a single sentient being among the classes of beings who is not encompassed by the bodhisatva’s love. Young prince, just as the realm of sentient beings is immeasurable, so is the bodhisatva’s cultivation of love immeasurable. Therefore, young prince, just as space is unlimited, sentient beings are unlimited. Just as sentient beings are unlimited, the bodhisatva’s love is unlimited. Neither the earth element, young prince, nor the water element, the fire element, or the wind element is greater than the realm of sentient beings.

source: གཞོན་ནུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཤར་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དང་། ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། དེ་བཞིན་དུ་ཕྱོགས་མཚམས་དང་། ཕྱོགས་བཅུ་ཀུན་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དང་མཉམ་པ་དེ་དག་ཐམས་ཅད་ཆུས་ཡོངས་སུ་གང་བའི་རྒྱ་མཚོར་གྱུར་པའི་རྒྱ་མཚོ་ཆེན་པོ་གཅིག་ཏུ་གྱུར་པ་ལ་ཡོངས་སུ་བརྟག་པ་བཟུང་སྟེ། དེ་ལ་སེམས་ཅན་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདུས་ནས། བརྒྱར་བཙལ་བའི་སྐྲའི་རྩེ་མོས་ཆུའི་ཐིགས་པ་གཅིག་བླངས། གཞན་ཡང་སེམས་ཅན་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདུས་ནས་བརྒྱར་བཙལ་བའི་སྐྲའི་རྩ་མོས་ཆུའི་ཐིགས་པ་གཉིས་བླངས། གཞན་ཡང་སེམས་ཅན་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདུས་ནས། བརྒྱར་བཙལ་བའི་སྐྲའི་རྩེ་མོས་ཆུའི་ཐིགས་པ་གསུམ་བླངས་ནས་གཞོན་ནུ་ཡོངས་སུ་བརྟག་པ་བཟུང་སྟེ། དེ་ལྟ་བུའི་ཐབས་ཀྱིས་ཆུའི་ཕུང་པོ་ཆེན་པོ་དེ་ཟད་པར་གྱུར་ཀྱང་སེམས་ཅན་གྱི་ཁམས་ནི་ཚད་དང་མཐའ་མེད་དེ། གཞོན་ནུ་སེམས་ཅན་གྱི་ཁམས་དེ་ལྟར་དཔག་ཏུ་མེད་ཅིང་དེ་ལྟར་མཐའ་ཡས་པ་དེ་ཐམས་ཅད་ལ་བྱང་ཆུབ་སེམས་དཔའི་བྱམས་པས་ཁྱབ་པར་བྱེད་དོ། ། གཞོན་ནུ་དེ་ཇི་སྙམ་དུ་སེམས། གང་དེ་ལྟར་དཔག་ཏུ་མེད་པར་བྱམས་པ་བསྒོམ་པའི་དགེ་བའི་རྩ་བ་དེའི་ཚད་གཟུང་བར་ནུས་སམ།
en: “ ‘I will illustrate this for you, young prince, so that you may reach an understanding of how immeasurable the realm of sentient beings is. Young prince, imagine that the worlds to the east, as numerous as the grains of sand in the river Ganges, those to the south, the west, the north, and the intermediate directions, and those above and below—the worlds in the ten directions as numerous as the grains of sand in the river Ganges—all became nothing but a single great ocean. Imagine then that sentient beings as numerous as the grains of sand in the river Ganges gathered, and each took from the ocean a drop of water as small as the tip of a hair split into one hundred parts. Imagine that sentient beings as numerous as the grains of sand in the river Ganges gathered, and each took from the ocean two drops of water as small as the tip of a hair split into one hundred. Imagine that sentient beings as numerous as the grains of sand in the river Ganges gathered, and each took from the ocean three drops of water as small as the tip of a hair split into one hundred parts. Young prince, this would deplete the water element, but there would still be no measure or limit to the realm of sentient beings. This, young prince, is how immeasurable, how unlimited, the realm of sentient beings is, and it is all encompassed by the love of the bodhisatva. What do you think young prince? Is it possible to definitively grasp the immeasurable root of virtue that is the cultivation of love?’

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །བདེ་བར་གཤེགས་པ་དེ་ནི་མ་ལགས་སོ།
en: “He replied, ‘Certainly not, Lord. Certainly not, Sugata.’

source: །གཞོན་ནུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བྱམས་པ་ཆེན་པོ་བསྒོམ་པའི་དགེ་བའི་རྩ་བ་ནི་དཔག་ཏུ་མེད་པ་ཡིན་ཏེ གཞོན་ནུ་དེའི་བྱམས་པ་ནི་བདག་སྲུང་བ་ཡིན། གཞན་ལ་ཕན་པར་གནས་པ་ཡིན། མཆོག་ཏུ་གནོད་སེམས་མེད་པ། ཁྲོ་བ་དང་གནོད་སེམས་ཀྱི་ཐབ་དང་བྲལ་བ། ཉེས་པ་འཇོམས་པ་རྗེས་སུ་ཆགས་པའི་ཀུན་ནས་ལྡང་བ་དང་བྲལ་བ། དད་པ་ཀུན་ཏུ་སྟོན་པ་འཁྲུལ་པ་ཐམས་ཅད་ལ་ཉེས་པར་ལྟ་བ། ཡོངས་སུ་གདུང་བ་མེད་པ། ལུས་དང་། ངག་དང་། སེམས་བདེ་བ་སྐྱེད་པ། གཞན་གྱི་གནོད་པར་བྱ་བ་ཐམས་ཅད་དུ་མ་ལྷུང་བ། འཇིགས་པ་ཐམས་ཅད་དང་བྲལ་བ་འཕགས་པའི་ལམ་དང་འཐུན་པ། གཤེ་བ་དང་ཁྲོས་པ་ལ་དང་བསྐྱེད་པ། གཡུལ་ཐམས་ཅད་ལས་སྒྲོལ་བ། དབྱིག་པ་དང་མཚོན་ཆ་མི་ཐོགས་པ། སེམས་ཅན་རབ་ཏུ་ཐར་བར་བྱ་བ་ལ་དགའ་བ། ཁོང་ཁྲོ་བ་ཐམས་ཅད་དང་བྲལ་བ། ཚུལ་འཆོས་པ་དང་། ཁ་གསག་དང་། འདྲིད་པ་དང་། གཞོགས་སློང་ཐམས་ཅད་དང་བྲལ་བ། རང་གི་རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པས་ཉེ་བར་འཚོ་བ། བརྒྱ་བྱིན་དང་། ཚངས་པས་ཕྱག་བྱས་པ། རང་གི་གཟི་བརྗིད་ཀྱིས་བརྒྱན་པ། མཁས་པས་བསྟོད་པ། བྱིས་པ་ཐམས་ཅད་རྗེས་སུ་སྲུང་བ། ཚངས་པའི་ལམ་དང་འཐུན་པ། འདོད་པའི་ཁམས་དང་མ་འདྲེས་པ། ཐར་པའི་ལམ་གྱི་གཙོ་བོར་གྱུར་པ། ཐེག་པ་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་བཟུང་བ། ཟང་ཟིང་མེད་པའི་བསོད་ནམས་ཀྱི་ཚོགས་བསགས་པ། རྫས་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་ཐམས་ཅད་ཀྱི་ཟིལ་གྱིས་མི་ནོན་པ། མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོས་ཡང་དག་པར་བརྒྱན་པ། དབང་པོ་ཉམས་ཤིང་མ་ཚང་བ་ཐམས་ཅད་སྤངས་པ། བདེ་འགྲོ་དང་། མྱ་ངན་ལས་འདའ་བའི་ལམ་ཐམས་ཅད་དུ་འགྲོ་བ། ངན་སོང་ཐམས་ཅད་དང་། མི་ཁོམ་པ་བརྒྱད་ལས་ཟློག་པ། ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་ཞིང་མོས་པ། འདོད་པའི་ལོངས་སྤྱོད་ཐམས་ཅད་དང་། དབང་པོ་དང་། རྒྱལ་སྲིད་ལ་མངོན་པར་མི་དགའ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་མཉམ་པའི་སེམས་ཀྱིས། སྦྱིན་པ་རབ་ཏུ་སྦྱོར་བ། ཐ་དད་པའི་འདུ་ཤེས་དང་བྲལ་བ། ཚུལ་ཁྲིམས་དང་བསླབ་པ་ཐམས་ཅད་ཀྱི་སྒོ་དང་ལམ། ཚུལ་ཁྲིམས་འཆལ་པ་ཐམས་ཅད་ཀྱི་སྐྱབས། བཟོད་པའི་སྟོབས་ཀུན་ཏུ་སྟོན་པ། ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་ཐམས་ཅད་དང་བྲལ་བ། མི་འཁྲུགས་པའི་བརྩོན་འགྲུས་རྩོམ་པ། ཡང་དག་པར་སྦྱོར་བའི་བྱ་བ་སྒྲོལ་བ། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་རྩ་བ། ཉོན་མོངས་པ་ལས་བྱུང་བ། སེམས་ངེས་པར་རྟོགས་པ། ཐོས་པ་འཛིན་པ། ཤེས་རབ་ཀྱི་རྒྱུ་སྐྱེད་པའི་བྱམས་པ། བདག་གི་ཕྱོགས་དང་གཞན་གྱི་ཕྱོགས་འཇོམས་པ། བདུད་དང་ཉོན་མོངས་པའི་ཕྱོགས་སེལ་བ། འགྲོགས་ན་བདེ་བ། ལྡང་བ་དང་། སློང་བ་དང་། འདུག་པ་དང་། ཉལ་བའི་སྤྱོད་ལམ་སྲུང་བར་བྱེད་པ། རྒོད་པའི་རང་བཞིན་ཡིད་ལ་བྱེད་པ་ཐམས་ཅད་སེལ་བ། དྲི་ཞིམ་པོས་བྱུགས་པ། ཁྲེལ་ཡོད་པ་དང་ངོ་ཚ་ཤེས་པས་བྱུགས་པ། མི་ཁོམ་པ་དང་། ཉོན་མོངས་པ་དང་། ངན་འགྲོ་ཐམས་ཅད་སེལ་བའི་བྱམས་པ། འགྲོ་བ་ཐམས་ཅད་སྐྱོབ་པའི་བྱམས་པ་ཆེན་པོ། བདག་གི་བདེ་བ་བཏང་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བ་རབ་ཏུ་སྦྱིན་པ་སྟེ།
en: “ ‘This, young prince, is how immeasurable the cultivation of great love, the root of virtue for the bodhisatvas, the great beings, is. With this love, young prince, one guards oneself and becomes a source of benefit for others. As it is the highest form of abstention from malice, it is free from destructive malice and anger. As it overcomes faults, it is free from the tendency toward desire. As one’s vision becomes immaculate, one can discern all erroneous faults. As one does not burn to obtain pleasures of the body, speech, or mind, one has no tendency toward exploiting others. One is free from all fear, and one lives according to the noble path. One is tranquil when faced with abuse and insults. One remains untouched by conflict. One does not resort to sticks and weapons. One accumulates beneficial nonmaterial riches. One rejoices in the liberation of sentient beings. One is free of any form of anger. One does not engage in hypocrisy, manipulation, fraud, or extortion. One is generous with one’s possessions, with favors, and with praise. One is honored by Śakra and Brahmā. One is adorned by one’s own radiance. One is praised by the learned. One protects all those who are immature. One follows the holy path. One is unaffected by the realm of desire. One is focused on the path of liberation. One incorporates all vehicles into one’s practice. Everything that one manifests through one’s meritorious activity is unsurpassed. One is adorned with the thirty-two characteristics and with the minor marks. All inferior and imperfect abilities have been discarded. One travels along all paths that lead to bliss and nirvāṇa. One has turned away from the lower realms and the eight states of misfortune. One takes delight in the pleasures of the Dharma. One rejoices in all pleasures, in possessions, influence, and kingship. One practices generosity by being even-minded toward all sentient beings. One is free from biased opinions. One’s path of complete proficiency in morality provides protection from all bad conduct. One teaches with the power of patient acceptance, and one is free from all egotism, haughtiness, and arrogance. One applies unshakeable vigor, and correct practice leads to emancipation. One bases oneself in the liberative meditative states, the attainments of concentration. One gives rise to the cause that is wisdom, and love comes through taking hold of learning. One overcomes one’s own opinions and the opinions of others, and one eliminates māras and vices. One takes care to be amiable when performing the spiritual practices connected to getting up, standing, sitting down, and sleeping, and one eliminates all arrogant ingrained concepts. Love, anointed with fragrant scents, anointed with modesty and humility, is what overcomes all states of misfortune, all the vices, and all the lower realms. Great love is what protects all who live. One shuns one’s own happiness, and one’s concern is to provide happiness for all sentient beings.

source: གཞོན་ནུ་ཉན་ཐོས་རྣམས་ཀྱི་བྱམས་པ་ནི་བདག་སྐྱོབ་པའོ། ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱམས་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་སྐྱོབ་པའོ། ། ཡང་གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དང་པོ་བསྐྱེད་པ་རྣམས་ཀྱི་བྱམས་པ་ནི་སེམས་ཅན་ལ་དམིགས་པའོ། ། བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་པ་ལ་ཞུགས་པ་རྣམས་ཀྱི་བྱམས་པ་ནི་ཆོས་ལ་དམིགས་པའོ། ། བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་རྣམས་ཀྱི་བྱམས་པ་ནི་དམིགས་པ་མེད་པའོ། ། གཞོན་ནུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བྱམས་པ་ཞེས་བྱ་སྟེ། ། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་དེ་ལ་རབ་ཏུ་གནས་པས་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པས་ཁྱབ་པར་བྱེད་དོ། །
en: “ ‘Young prince, the love of the śrāvakas is self-centered, but the love of the bodhisatvas embraces all sentient beings. Young prince, the love of the bodhisatvas, in whom the mind of awakening has arisen for the first time, has sentient beings as its object. The love of the bodhisatvas, who are engaged in practice, has phenomena as its object. The love of the bodhisatvas, who are proficient in patient acceptance, has no object. This, young prince, is how the love of the bodhisatvas, the great beings, is described. When this love has firmly taken root in the bodhisatva, it encompasses all sentient beings.
